# MassEnergyAnalyticalModelId Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassZone..::..MassEnergyAnalyticalModelId Property
MassZone Class See Also
---
The ElementId of the MassEnergyAnalyticalModel that the MassZone is derived from.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId MassEnergyAnalyticalModelId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MassEnergyAnalyticalModelId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ MassEnergyAnalyticalModelId {
	ElementId^ get ();
}
```

# See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace